In [1]:
import pymysql

In [2]:
import sqlalchemy

In [3]:
import pandas as pd
import numpy as np

In [4]:
from sqlalchemy import create_engine
from getpass import getpass

In [5]:
password = getpass()

········

In [6]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [7]:
type(engine)

sqlalchemy.engine.base.Engine

In [8]:
data = pd.read_sql_query('SELECT count(rental_id), Month(rental_date), year(rental_date)FROM rental group by Month(rental_date), year(rental_date)', engine)
data.head()

   count(rental_id)  Month(rental_date)  year(rental_date)
0              1156                   5               2005
1              2311                   6               2005
2              6709                   7               2005
3              5686                   8               2005
4               182                   2               2006

In [12]:
def rentals_month(engine, month, year):
    query = f"""SELECT * from rental where month(rental_date)={month} and year(rental_date)={year}"""
    rental_data = pd.read_sql(query, engine)
    return rental_data

In [26]:
data_month5=rentals_month(engine,5,2005)
data_month5

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53

In [39]:
data_month7=rentals_month(engine,7,2005)

In [40]:
df1=df.groupby('customer_id')['rental_id'].count()
df1

customer_id
1      2
2      1
3      2
5      3
6      3
      ..
594    4
595    1
596    6
597    2
599    1
Name: rental_id, Length: 520, dtype: int64

In [41]:
def rental_count_month(x):
    rental_count = x.groupby('customer_id')['rental_id'].count().reset_index()
    return rental_count
# reset index converts the series to a dataframe

In [48]:
count_month7=rental_count_month(data_month7)

In [49]:
count_month5=rental_count_month(data_month5)

In [54]:
#merging data_month7 and data_month5 to merged_dataframe 
merge_df=pd.merge(count_month7, count_month5, on='customer_id' )

In [56]:
merge_df['difference']=merge_df['rental_id_x']-merge_df['rental_id_y']
merge_df

     customer_id  rental_id_x  rental_id_y  difference
0              1           12            2          10
1              2           14            1          13
2              3           13            2          11
3              5           16            3          13
4              6            9            3           6
..           ...          ...          ...         ...
515          594           14            4          10
516          595           19            1          18
517          596            6            6           0
518          597            7            2           5
519          599            7            1           6

[520 rows x 4 columns]